Repository: ndevanthery/HealthSim
Catalog: lib/l10n/app_*.arb
Languages: de, fr

# accueil
source: Home
de: Startseite
fr: Accueil

# apropos
source: About
de: Über uns
fr: A propos

source: Contact
de: Kontakt

# creercompte
source: Sign Up
de: Registrieren
fr: Inscription

# senregistrer
source: Log In
de: Anmelden
fr: Connexion

# votresantetitre
source: Your Health is your Wealth
de: Deine Gesundheit ist dein Reichtum
fr: Votre santé c'est votre avenir

# completequetionnairedescription
source: Answer the questionnaire about your health history, lifestyle, habits and discover your position compared to the population !
de: Beantworte den Fragebogen zu deinem Gesundheitszustand, deinem Lebensstil, deinen Gewohnheiten und finde heraus, wie du im Vergleich zur Bevölkerung stehst!
fr: Répondez au questionnaire sur votre historique de santé, votre style de vie, vos habitudes et découvrez votre position par rapport à la population !

# lancerquestionnaire
source: Start questionnaire
de: Fragebogen starten
fr: Lancer le questionnaire

# colonneun
source: Fill in questionnaire
de: Fragebogen ausfüllen
fr: Rempli le questionnaire

# colonnedeux
source: Compare yourself
de: Vergleiche dich
fr: Compare toi

# colonnetrois
source: Simulate the results
de: Simuliere die Ergebnisse
fr: Simule les résultats

# apropostexte
source: This application was created by four dedicated students who worked in collaboration with two esteemed educational institutions - the HES-SO Valais Wallis and the Haaga-Helia University of Applied Sciences in Finland, making this project an international effort. We have poured our hearts and souls into developing an innovative, cutting-edge application that aims to help the healthcare industry by providing users with access to the latest advancements in medical algorythms. With a focus on user experience, this application has been designed to be intuitive and user-friendly, with features that are tailored to meet the needs of healthcare providers and patients alike. We are proud to have been a part of this incredible project and are excited to see the impact it will have on the healthcare industry in the years to come.
de: Diese Anwendung wurde von vier engagierten Studenten entwickelt, die in Zusammenarbeit mit zwei renommierten Bildungseinrichtungen - der HES-SO Valais Wallis und der Haaga-Helia University of Applied Sciences in Finnland - an diesem internationalen Projekt gearbeitet haben. Wir haben unser Herzblut in die Entwicklung einer innovativen, modernen Anwendung gesteckt, die das Gesundheitswesen unterstützen soll, indem sie den Benutzern Zugang zu den neuesten Entwicklungen in der medizinischen Algorithmik bietet. Mit einem Schwerpunkt auf Benutzererfahrung wurde diese Anwendung so konzipiert, dass sie intuitiv und benutzerfreundlich ist und Funktionen bietet, die den Bedürfnissen von Gesundheitsdienstleistern und Patienten gleichermaßen gerecht werden. Wir sind stolz darauf, Teil dieses unglaublichen Projekts gewesen zu sein, und freuen uns auf die Auswirkungen, die es in den kommenden Jahren auf das Gesundheitswesen haben wird.
fr: Cette application a été créée par quatre étudiants dévoués qui ont travaillé en collaboration avec deux institutions éducatives prestigieuses - la HES-SO Valais Wallis et la Haaga-Helia University of Applied Sciences en Finlande, faisant de ce projet un effort international. Nous avons mis tout notre cœur et notre âme dans le développement d'une application innovante et de pointe qui vise à aider l'industrie de la santé en offrant aux utilisateurs l'accès aux dernières avancées en matière d'algorithmes médicaux. Axée sur l'expérience utilisateur, cette application a été conçue pour être intuitive et conviviale, avec des fonctionnalités adaptées aux besoins des prestataires de soins de santé et des patients. Nous sommes fiers d'avoir fait partie de ce projet incroyable et sommes ravis de voir l'impact qu'il aura sur l'industrie de la santé dans les années à venir.

# motdepasse
source: Password
de: Passwort
fr: Mot de passe

# nomcomplet
source: Full name
de: Vollständiger Name
fr: Nom complet

# confirmemdp
source: Confirm password
de: Passwort bestätigen
fr: Confirmer Mot de passe

source: Logout
de: Abmelden
fr: Déconnecter

# questionnairetitle
source: Questionnaire
de: Fragebogen

# questionnairecancel
source: Cancel
de: Abbrechen
fr: Annuler

# questionnairenext
source: Next
de: Weiter
fr: Prochain

# questionnaireintrotitle
source: This questionnaire is divided into 3 parts and here is the first one
de: Dieser Fragebogen ist in 3 Teile unterteilt und hier ist der erste
fr: Ce questionnaire est divisé en 3 partie. Voici la première

# questionnaireintrotext
source: Yourself If you don't have an answer for some questions go directly to the next one
de: Über dich selbst Wenn du keine Antwort auf einige Fragen hast, gehe direkt zur nächsten Frage
fr: Données personnelles

# questionnaireintrotextbutton
source: Let's go !
de: Los geht's!
fr: C'est parti !

# questionnairegendertitle
source: What is your gender?
de: Was ist dein Geschlecht?
fr: Quel est votre genre ?

# questionnairegenderanswerpositive
source: Man
de: Mann
fr: Homme

# questionnairegenderanswernegative
source: Woman
de: Frau
fr: Femme

# questionnaireagetitle
source: How old are you?
de: Wie alt bist du?
fr: Quel âge avez-vous ?

# questionnaireagehint
source: Enter your age
de: Gib dein Alter ein
fr: Entrez votre âge

# questionnaireheighttitle
source: What is your height in cm?
de: Wie groß bist du in cm?
fr: Quel est votre taille en cm ?

# questionnaireheighthint
source: Enter your height
de: Gib deine Größe ein
fr: Entrez votre taille

# questionnaireweighttitle
source: What is your weight in kg?
de: Wie viel wiegst du in kg?
fr: Quel est votre poids en kg ?

# questionnaireweighthint
source: Enter your weight
de: Gib dein Gewicht ein
fr: Entrez votre poids

# questionnaireglyctitle
source: Are you known to have high blood sugar?
de: Hast du einen hohen Blutzucker?
fr: Etes-vous connus pour un sucre sanguin élevé ?

# answerpositive
source: Yes
de: Ja
fr: Oui

# answernegative
source: No
de: Nein
fr: Non

# questionnairehighsysttitle
source: Are you known to have high blood pressure?
de: Hast du hohen Blutdruck?
fr: Etes-vous connus pour une tension élevée ?

# questionnairesysttitle
source: What is your blood pressure between 80 and 200 mmHg?
de: Was ist dein Blutdruck zwischen 80 und 200 mmHg? Drücke 'Weiter', wenn du es nicht weißt.
fr: Quelle est votre tension entre 80 et 200 mmHg ? Cliquez sur 'Next' si vous ne le savez pas

# questionnairesysthint
source: Enter your blood pressure
de: Gib deinen Blutdruck ein
fr: Entrez votre tension

# questionnairehighcholtitle
source: Are you known to have high cholesterol?
de: Hast du hohe Cholesterinwerte?
fr: Etes-vous connus pour un taux de cholestérol élevé ?

# questionnairecholtitle
source: What is your cholesterol level between 2.5 and 8 mmol/l?
de: Was ist dein Cholesterinwert zwischen 2,5 und 8 mmol/l? Drücke 'Weiter', wenn du es nicht weißt.
fr: Quel est votre taux de cholestérol entre 2.5 et 8 mmol/l ? Cliquez sur 'Next' si vous ne le savez pas

# questionnairecholhint
source: Enter your cholesterol level
de: Gib deinen Cholesterinwert ein
fr: Entrez votre taux de cholestérol

# questionnairehdltitle
source: What is your HDL level between 0.6 and 2.5 mmol/l?
de: Was ist dein HDL-Wert zwischen 0,6 und 2,5 mmol/l? Drücke 'Weiter', wenn du es nicht weißt.
fr: Quel est votre taux de HDL entre 0.6 et 2.5 mmol/l ? Cliquez sur 'Next' si vous ne le savez pas

# questionnairehdlhint
source: Enter your HDL level
de: Gib deinen HDL-Wert ein
fr: Entrez votre taux de HDL

# questionnairediabtitle
source: Are you diabetic?
de: Bist du Diabetiker?
fr: Etes-vous diabétique ?

# questionnaireinftitle
source: Have you ever had a heart attack?
de: Hattest du jemals einen Herzinfarkt?
fr: Avez-vous déjà eu un infarctus ?

# questionnaireavctitle
source: Have you ever had a stroke?
de: Hattest du jemals einen Schlaganfall?
fr: Avez-vous déjà eu une attaque cérébrale ?

# questionnairesecondparttitle
source: Family
de: Familie
fr: Famille

# questionnairesecondparttext
source: Here is the second part
de: Hier ist der zweite Teil
fr: Voici la deuxième partie

# questionnairesecondparttextbutton
source: Let's go !
de: Los geht's!
fr: C'est partie !

# questionnaireafinftitle
source: Have any of your parents (father before age 55, mother before age 65) ever had a heart attack?
de: Hat einer deiner Eltern (Vater vor dem 55. Lebensjahr, Mutter vor dem 65. Lebensjahr) jemals einen Herzinfarkt gehabt?
fr: Est-ce que un de vos parents (père avant 55 ans, mère avant 65 ans) a déjà eu un infarctus ?

# questionnaireafcancertitle
source: Does someone close to you (father, mother, siblings) have cancer?
de: Hat jemand in deiner Familie (Vater, Mutter, Geschwister) Krebs?
fr: Est-ce que un de vos proche (père, mère, frères ou soeurs) a un cancer ?

# questionnairelastparttitle
source: Your habits
de: Deine Gewohnheiten
fr: Vos habitudes

# questionnairelastparttext
source: Here is the last part
de: Hier ist der letzte Teil
fr: Voici la dernière partie

# questionnairelastparttextbutton
source: Let's go !
de: Los geht's!
fr: C'est partie !

# questionnairesmoketitle
source: Have you ever smoked regularly once in your life?
de: Hast du jemals regelmäßig geraucht?
fr: Est-ce que vous avez déjà fumé régulièrement une fois dans votre vie ?

# questionnairealimtitle
source: What are your eating habits?
de: Wie sieht deine Ernährung aus? (Obst, Gemüse, Olivenöl, Nüsse, fetter Fisch, wenig Fleisch, Sahne oder Wurstwaren)
fr: Quels sont vos habitudes alimentaires ? (Fruits, légumes, huile d'olive, noix, poissons gras, peu de viande, de crème, de charcuterie)

# questionnairealimtext
source: 0 = bad 1 = small 2 = some 3 = good
de: 0 = Nie 1 = Teilweise, gelegentlich 2 = Teilweise, häufig 3 = Vollständig, meistens
fr: 0 = Jamais 1 = Partiellement, de temps en temps 2 = Partiellement, fréquemment 3 = Totalement, la plupart du temps

# questionnairealimminvalue
source: Bad
de: Schlecht
fr: Mauvaises

# questionnairealimmaxvalue
source: Good
de: Gut
fr: Bonnes

# questionnairesporttitle
source: What are your sports habits?
de: Wie sieht dein Sportverhalten aus?
fr: Quelles sont vos habitudes sportives ?

# questionnairesporttext
source: 0 = no movement 1 = 30 min 2-3 days/week 2 = 30 min 5 days/week 3 = 2 hrs intense/week
de: 0 = keine Bewegung 1 = 30 Minuten 2-3 Mal pro Woche 2 = 30 Minuten 5 Mal pro Woche 3 = 2 Stunden intensives Training pro Woche
fr: 0 = ne bouge pas 1 = 30 min 2-3 jours/semaine 2 = 30 min 5 jours/semaine 3 = 2 h intense/semaine

# questionnairesportminvalue
source: No movement
de: Keine Bewegung
fr: Ne bouge pas

# questionnairesportmaxvalue
source: 2 hrs intense/week
de: 2 Stunden intensives Training pro Woche
fr: 2 h intense/semaine

# questionnairefinaltitle
source: Congratulations !
de: Herzlichen Glückwunsch!
fr: Félicitation !

# questionnairefinaltext
source: You have completed the questionnaire
de: Du hast den Fragebogen vollständig ausgefüllt.
fr: Vous avez terminé le questionnaire

# questionnairefinaltextbutton
source: Send
de: Abschicken
fr: Envoyer

# resulttitle
source: Result
de: Ergebnis
fr: Résultat

# resultriskresulttitle
source: Your Health Risks
de: Dein Gesundheitsrisiko
fr: Vos risques pour la santé

# resultcancerrisktitle
source: Cancer Risk
de: Krebsrisiko
fr: Risque de cancer

# resultinfrisktitle
source: Heart Disease Risk
de: Risiko von Herzkrankheiten
fr: Risque d'infarctus

# resultdiabrisktitle
source: Diabetes Risk
de: Diabetesrisiko
fr: Risque de diabète

# resultcomparationtitlesecondcolunm
source: Your answers
de: Deine Antworten
fr: Vos réponses

# resultcomparationtitlelastcolunm
source: The answers from average person
de: Die Antworten der Durchschnittsbevölkerung
fr: Les réponses de la moyenne population

# resultcomparationtitlesecondrow
source: Alimentation
de: Ernährung

# resultcomparationtitlethirdrow
source: Alcool
de: Alkohol

# resultcomparationtitlelastrow
source: Smoke ?
de: Rauchen?
fr: Fume ?

# resultsimulationtitle
source: Simulate the Impact of Changing Your Habits
de: Simuliere den Einfluss von Veränderungen deiner Gewohnheiten
fr: Simuler l'impact d'un changement de comportement

# resultsimulationresetbutton
source: Reset Simulation
de: Simulation zurücksetzen
fr: Réinitialiser la simulation

# resultsimulationsmokebutton
source: Smoking
de: Rauchen
fr: Fumer

# resultsimulationalcool
source: Drinking Alcohol
de: Alkoholkonsum
fr: Consommation d'alcool

# resultsimulationalim
source: Eating habits:
de: Essgewohnheiten:
fr: Les habitudes alimentaires :

# resultsimulationsport
source: Exercising Regularly:
de: Regelmäßig Sport treiben:
fr: L'exercice régulièrement :

# resultcardyou
source: Your
de: Dein
fr: Toi

# resultcardavgpeople
source: Average people
de: Durchschnittswert
fr: Moyenne population

# resultsimulationinfo
source: Simulators to the right: more favorable behavior
de: Simulatoren rechts: günstigeres Verhalten
fr: Simulateurs vers la droite: comportement plus favorable

# resultsimulationweight
source: Weight
de: Gewicht
fr: Poids

# resultprintbutton
source: Print
de: Ergebnisse drucken
fr: Imprimer les résultats

# answeralim0
source: Never
de: Nie
fr: Jamais

# answeralim1
source: Occasionally
de: Gelegentlich
fr: De temps en temps

# answeralim2
source: Frequently
de: Häufig
fr: Fréquemment

# answeralim3
source: Most of the time
de: Meistens
fr: La plupart du temps

# answersport0
source: No movement
de: Keine Bewegung
fr: Ne bouge pas

# answersport1
source: 30 min 2-3 days/week
de: 30 Min. 2-3 Mal/Woche
fr: 30 min 2-3 jours/semaine

# answersport2
source: 30 min 5 days/week
de: 30 Min. 5 Mal/Woche
fr: 30 min 5 jours/semaine

# answersport3
source: 2 hrs intense/week
de: 2 Std. intensiv/Woche
fr: 2 h intense/semaine

# answeralcool0
source: Every day
de: Jeden Tag
fr: Tous les jours

# answeralcool1
source: 3 to 6 days/week
de: 3 bis 6 Tage/Woche
fr: 3 à 6 jours/semaine

# answeralcool2
source: 1 to 2 days/week
de: 1 bis 2 Tage/Woche
fr: 1 à 2 jours/semaine

# answeralcool3
source: Less than 1 day/week
de: Weniger als 1 Tag/Woche
fr: Moins 1 jours/semaine

# answeralcool4
source: Do not drink
de: Trinke nicht
fr: Ne bois pas

# printtitlequestion
source: Questions
de: Fragen

# printtitleanswer
source: Answers
de: Antworten
fr: Réponses

# questionnairealcooltitle
source: What is your alcohol consumption?
fr: Qu'elle est votre consommation d'alcool ?

# questionnairealcooltext
source: 0 = every day 1 = 3 to 6 days/week 2 = 1 to 2 days/week 3 = less than 1 day/week 4 = do not drink
fr: 0 = tous les jours 1 = 3 à 6 jours/semaine 2 = 1 à 2 jours/semaine 3 = moins 1 jours/semaine 4 = Ne bois pas

# questionnairealcoolminvalue
source: Every day
fr: Tous les jours

# questionnairealcoolmaxvalue
source: Do not drink
fr: Ne bois pas
